package com.company.training.linear;

//Дан прямоугольник, ширина которого в 2 раза меньше длины. найти площадь прямоугольника

public class Task7 {
	
	public static void main(String[] args) {
		
		double lenght;
		double width;
		double area;
		
		
		lenght = 9;
		width = lenght / 2;
		
		area = lenght * width;
		
		System.out.print("Area of rectange is " + area + " cm");
	}

}
