package com.company.training.linear;

//Написать программу, которая выводит на экран первые четыре степени числа пи.

public class Task15 {
	
	public static void main(String[] args) {
		
		
		for(int i = 1; i < 5; i++) {
			
			System.out.println(Math.pow(Math.PI, i));
		}
	}

}
